app/Controllers/CustomerController.php

SELECT *
FROM `notifications`
WHERE `customer_id` = '3'
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `customer_id` = '3'
AND `is_read` = 0
---
    public function fetchNotifications()
    {
        $session = session();
        $customerId = $session->get('user_id');  // Get customer ID from session

        if (!$customerId) {
            return $this->response->setJSON([
                'notifications' => [],
                'unread' => 0
            ]);
        }

        $notificationModel = new \App\Models\NotificationModel();
        $notifications = $notificationModel
            ->where('customer_id', $customerId)
            ->orderBy('created_at', 'desc')
            ->findAll(5);

        $unreadCount = $notificationModel
            ->where('customer_id', $customerId)
            ->where('is_read', 0)
            ->countAllResults();